finall repo updates about content
